"""
    Написать программу, которая при запуске принимает 2 параметра командной строки - имя файла и операцию, которую с ним надо сделать.
    Параметр для указания файла: --file <file name and path>, параметр для указания действия: --option <option name>.

    Задания:
    1. Вывести на экран введенные параметры - имя файла и название действия (что указано при запуске)
    2. Реализовать суммирование цифр в файле, пропуская буквы и слова. Пример: если в файле указано
        1 2 33        привет     10
       программа должна вывести результат суммирования: 46
    3. <продолжение следует>
"""